Revit 2027 API
ParameterTypeId.FamilyRotateTextWithComponent Property
 "Rotate text with component"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FamilyRotateTextWithComponent { get; }
Public Shared ReadOnly Property FamilyRotateTextWithComponent As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FamilyRotateTextWithComponent {
	ForgeTypeId^ get ();
}
static member FamilyRotateTextWithComponent : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace